# Ecological Data Wrangling with Python  and Pandas

This Jupyter Notebook contains 5 functions that perform various data-wrangling steps, including constructing a text facet, constructing a numeric cluster, and clustering a column of text entries. Additionally, there are functions for string processing, such as trimming whitespace and replacing internal whitespace with a single space.

Each function below has been tested with examples to ensure they work as intended.

In [ ]:
# importing some libraries
import pandas as pd
import numpy as np
import re
import math
from sklearn.cluster import AffinityPropagation
import distance
from difflib import SequenceMatcher
import re

### Load data and figure out some aspect of it:

In [16]:
#Initialize the filename
fileName ="Portal_rodents_19772002_scinameUUIDs.csv"

In [136]:
#read the csv file with pandas
df = pd.read_csv(fileName, sep=",",engine="python")

In [141]:
#print 5 first rows
df.head(3)

,survey_id,recordID,mo,dy,yr,period,plot_id,plot,note1,stake,...,tag,note2,ltag,note3,prevrt,prevlet,nestdir,neststk,note4,note5
0,491ec41b-0a80-4ce9-b754-2983c6f38e71,6545,9,18,1982,62.0,4dc16022-f28d-4b9d-9062-c7bc3ad43362,13,13.0,36.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,f280bade-4e9b-447d-afe0-9e6d45e6bfb0,5220,1,24,1982,54.0,dcbbd373-c22e-46ef-ae8b-ad88f5cf7475,20,13.0,27.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2b1b4a8a-c3e9-4781-a5f9-18b081383876,18932,8,7,1991,162.0,1e87b11b-4795-4f41-bdff-2d5c4412be25,19,13.0,33.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D

In [19]:
#describe the data frame to understand it better
df.describe()

,recordID,mo,dy,yr,period,plot,note1,stake,decimalLatitude,decimalLongitude,hfl,wgt,prevlet,neststk
count,35549.000000,35549.000000,35549.000000,35549.000000,35549.000000,35549.000000,3592.000000,35479.000000,60.000000,60.000000,31438.000000,32283.000000,33478.000000,5436.000000
mean,17775.000000,6.474022,16.105966,1990.475231,149.534263,11.397001,7.322105,44.804138,42.510023,-109.475797,29.287932,42.672428,2.579216,19.756439
std,10262.256696,3.396583,8.256691,7.493355,97.092749,6.799406,4.216711,23.453326,6.328684,12.551608,9.564759,36.631259,100.371258,26.534418
min,1.000000,1.000000,1.000000,1977.000000,-284.000000,1.000000,1.000000,-99.000000,28.634440,-115.942700,2.000000,4.000000,0.000000,-2.000000
25%,8888.000000,4.000000,9.000000,1984.000000,73.000000,5.000000,5.000000,25.000000,45.390723,-115.920298,21.000000,20.000000,0.000000,0.000000
50%,17775.000000,6.000000,16.000000,1990.000000,149.000000,11.000000,6.000000,45.000000,45.450000,-115.855953,32.000000,37.000000,0.000000,0.000000
75%,26662.000000,9.000000,23.000000,1997.000000,234.000000,17.000000,13.000000,64.000000,45.597618,-115.038401,36.000000,48.000000,0.000000,43.000000
max,35549.000000,12.000000,31.000000,2002.000000,295.000000,24.000000,13.000000,99.000000,46.337780,-82.359440,70.000000,280.000000,8000.000000,99.000000

In [20]:
#check the number of null values of each column/feature
df.isnull().sum()

survey_id               0
recordID                0
mo                      0
dy                      0
yr                      0
period                  0
plot_id                 0
plot                    0
note1               31957
stake                  70
species              2015
scientificName      15318
locality            34874
JSON                35483
decimalLatitude     35489
decimalLongitude    35489
county              35453
state               35183
country             34871
sex                  2506
age                 20103
reprod              33898
testes              25857
vagina              33952
pregnant            34327
nipples             30521
lactation           35423
hfl                  4111
wgt                  3266
tag                  2324
note2               30965
ltag                 1901
note3               35533
prevrt               1780
prevlet              2071
nestdir             33718
neststk             30113
note4               34908
note5               32451
dtype: int64

### (1)construct a text facet when given a column with text strings as entries;

In [21]:
def text_facet(df,col):
    #define a condition that if that feature represent String data 
    #return the text facet otherwise tell the type is not valid
    #to have text_facet like open refine
    # apply some some function on dataframe like
    #groupby column, then choose the desired column and apply for the count
    if df[col].dtypes=="O":

        return df.groupby(col)[col].count()
    else:
        return('This feature is not object')

In [22]:
# Example:
# applying text_facet function on object feature
text_facet(df,'yr')

'This feature is not object'

In [9]:
# Example:
# applying text_facet function on object feature with String data
text_facet(df,'scientificName')

scientificName
  Amphispiza bilineata                 1
  Amphispiza bilineata                 1
Ammodramus savannarum                  2
Ammospermophilis harrisi               1
Ammospermophilus harrisi             435
Ammospermophilus harrisii              1
Amphespiza bilineata                   7
Amphispiza bilineata                 289
Amphispiza bilineatus                  1
Amphispiza cilineata                   1
Amphispizo bilineata                   1
Baiomys taylori                       46
Calamospiza melanocorys                1
Callipepla squamata                    1
Campylorhynchus brunneicapillus        1
Chaetodipus baileyi                    2
Cnemidophorus tigris                   1
Cnemidophorus uniparens                1
Crotalus scutalatus                    1
Crotalus viridis                       1
Dipodomys merriami                 10596
Dipodomys ordii                     3027
Dipodomys spectabilis               2504
DipodomysÂ sp.                         40
Emphispiza bilinata                    2
Onychomys leucogaster               1006
Onychomys torridus                  2249
OnychomysÂ sp.                         12
Name: scientificName, dtype: int64

### (2) Construct a numeric facet when given a column with numeric entries, with the option of using a log scale;

In [62]:
#define a condition that if that feature represent String data 
# tell the type is not valid; otherwise return the numeric facet
#to have num_facet like open refine
# apply some some function on dataframe lik
#groupby log of column, then choose the desired column and apply for its count
# filter zero values since (log 0) gives error
def num_facet(df,col):
    if df[col].dtypes!="O":
        return df[df[col] != 0].groupby(np.log( df[col]))[col].count()
    else:
        return('This feature is object and Log scale can not be applied to it')

In [63]:
# Example:
# applying num_facet function on object feature
num_facet(df,'scientificName')

'This feature is object and Log scale can not be applied to it'

In [64]:
# Example:
# applying num_facet function on integer feature
num_facet(df,'period')

period
0.000000     62
0.693147     94
1.098612     86
1.386294    102
1.609438     75
           ...
5.673323     88
5.676754    213
5.680173    218
5.683580    197
5.686975    164
Name: period, Length: 295, dtype: int64

### (3) Cluster a column of text entries (using an appropriate clustering method);

In [96]:
#cluster column based on similarity rate
# similar rate works as threshold
def clusteringByColumn(col, similarity_rate):
    # calculating the unique values of specific column and initial it to words
    words =df[col].unique().astype(str) 

    # calculate the similarity rate of each unique value and all the other unique values in words 
    # if the lenght of words is n, lev_similarity is a list with n lists and each list has lenght of n as well
    lev_similarity = np.array([[SequenceMatcher(None, w1,w2).ratio() for w1 in words] for w2 in words])
    
    # similarity_rate works as a threshold 
    # check if the similarity value is above the threshold/similarity_rate, 
    # calculate its index and add to the corresponding set
    indexes = [ set(index for index in range(len(i)) if i[index] >= similarity_rate) for i in lev_similarity ]
    
    #eliminate the set with one elements thats means they dont have any similar item based on threshold of similarity rate
    cluster_index = [ i for i in indexes if len(i)>1]   
    
    # remove the duplicates
    c_index = np.unique(cluster_index)
    
    # eliminate the subsets of each main sets: having a list with several set of index and their intersection is empty 
    cluster_index= [x for x in c_index if not any(set(x)<=set(y) for y in c_index if x is not y)]
    
    #print the indexes
    print('Indexes of Clusters: ', cluster_index)
    
    # find the elements of clusters based on their index
    #cluster_words = {'cluster': [words[i] for i in index] for i in cluster_index }
    cluster_words = { j+1 : [words[i] for i in cluster_index[j]] for j in range(len(cluster_index)) }
    
    # return clusters including more than 2 items
    return  cluster_words

In [97]:
#Example:
# clustering scientificName column with rate of similarity 0.9501
clusteringByColumn('scientificName', 0.9501)

Indexes of Cluster:  [{0, 1, 7}, {3, 4, 5}]

{1: ['  Amphispiza bilineata',
  '  Amphispiza bilineata  ',
  'Amphispiza bilineata'],
 2: ['Ammospermophilis harrisi',
  'Ammospermophilus harrisi',
  'Ammospermophilus harrisii']}

In [124]:
#Example:
# clustering year column with rate of similarity 0.75
clusteringByColumn('yr',0.75)

Indexes of Cluster:  [{18, 19, 20}, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 21, 22, 23, 25}]

{1: ['2000', '2001', '2002'],
 2: ['1982',
  '1991',
  '1993',
  '1983',
  '1984',
  '1985',
  '1986',
  '1987',
  '1988',
  '1989',
  '1990',
  '1992',
  '1994',
  '1995',
  '1996',
  '1997',
  '1998',
  '1999',
  '1978',
  '1980',
  '1981',
  '1979']}

### (4) For string processing by trimming all whitespace at the start and end of a string

In [102]:
#By using lambda, this function goes through each feature and if its type
#is object/ string, remove white space at the start and the beginning.
#And apply these changes to the data frame
def whiteSpace_trimm(df):
    return df.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

### (5) For string processing by replacing internal whitespace by a single space

In [103]:
#By using lambda, this function goes through each feature and if its type
#is object/String, Remove ONLY DUPLICATE spaces.
#And apply these changes to the data frame
def one_whiteSpace(df):
    return df.applymap(lambda x: " ".join(re.split("\s+", x, flags=re.UNICODE))
                            if type(x) == str else x)

In [106]:
# define an another dataframe by applying whiteSpace_trimm on the main dataframe
df1 = whiteSpace_trimm(df)
df1.head(3)

,survey_id,recordID,mo,dy,yr,period,plot_id,plot,note1,stake,...,tag,note2,ltag,note3,prevrt,prevlet,nestdir,neststk,note4,note5
0,491ec41b-0a80-4ce9-b754-2983c6f38e71,6545,9,18,1982,62.0,4dc16022-f28d-4b9d-9062-c7bc3ad43362,13,13.0,36.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,f280bade-4e9b-447d-afe0-9e6d45e6bfb0,5220,1,24,1982,54.0,dcbbd373-c22e-46ef-ae8b-ad88f5cf7475,20,13.0,27.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2b1b4a8a-c3e9-4781-a5f9-18b081383876,18932,8,7,1991,162.0,1e87b11b-4795-4f41-bdff-2d5c4412be25,19,13.0,33.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D

In [107]:
#Example:
# run text_facet on scientificName to check if the white spaces are elimited
df1 = whiteSpace_trimm(df)
text_facet(df1,'scientificName')

scientificName
Ammodramus savannarum                  2
Ammospermophilis harrisi               1
Ammospermophilus harrisi             435
Ammospermophilus harrisii              1
Amphespiza bilineata                   7
Amphispiza bilineata                 291
Amphispiza bilineatus                  1
Amphispiza cilineata                   1
Amphispizo bilineata                   1
Baiomys taylori                       46
Calamospiza melanocorys                1
Callipepla squamata                    1
Campylorhynchus brunneicapillus        1
Chaetodipus baileyi                    2
Cnemidophorus tigris                   1
Cnemidophorus uniparens                1
Crotalus scutalatus                    1
Crotalus viridis                       1
Dipodomys merriami                 10596
Dipodomys ordii                     3027
Dipodomys spectabilis               2504
DipodomysÂ sp.                         40
Emphispiza bilinata                    2
Onychomys leucogaster               1006
Onychomys torridus                  2249
OnychomysÂ sp.                         12
Name: scientificName, dtype: int64

In [19]:
#Example:
# run text_facet on scientificName to check if the middle white spaces are elimited
df2 = whiteSpace_trimm(df)
text_facet(df2,'scientificName')

scientificName
Ammodramus savannarum                  2
Ammospermophilis harrisi               1
Ammospermophilus harrisi             435
Ammospermophilus harrisii              1
Amphespiza bilineata                   7
Amphispiza bilineata                 291
Amphispiza bilineatus                  1
Amphispiza cilineata                   1
Amphispizo bilineata                   1
Baiomys taylori                       46
Calamospiza melanocorys                1
Callipepla squamata                    1
Campylorhynchus brunneicapillus        1
Chaetodipus baileyi                    2
Cnemidophorus tigris                   1
Cnemidophorus uniparens                1
Crotalus scutalatus                    1
Crotalus viridis                       1
Dipodomys merriami                 10596
Dipodomys ordii                     3027
Dipodomys spectabilis               2504
DipodomysÂ sp.                         40
Emphispiza bilinata                    2
Onychomys leucogaster               1006
Onychomys torridus                  2249
OnychomysÂ sp.                         12
Name: scientificName, dtype: int64

In [119]:
import re
s='491ec41b-0a80-4ce9-b754-2983c6f38e71      gfjgh'
#Remove ALL spaces in a string, even between words:
s = re.sub(r"\s+", "", s, flags=re.UNICODE)
#Remove spaces both in the BEGINNING and in the END of a string:
s = re.sub(r"^\s+", "", s, flags=re.UNICODE)
#Remove spaces in the END of a string:
s = re.sub(r"\s+$", "", s, flags=re.UNICODE)
#Remove ONLY DUPLICATE spaces:
s = " ".join(re.split("\s+", s, flags=re.UNICODE)) #only one space